//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//456 -> 5; 782 -> 8; 918 -> 1
Console.WriteLine();

string str1 = 456.ToString();
Console.WriteLine(str1[1]);

 string str2 = 782.ToString();
Console.WriteLine(str2[1]);

string str3 = 918.ToString();
Console.WriteLine(str3[1]);
